# Pandas

It's a little messy, but each section is the material covered in one video. Hope I can understand this in the future.

## How do I read a tabular data into pandas?

In [1]:
import pandas as pd

In [2]:
# Method to read tables
orders = pd.read_table('http://bit.ly/chiporders')

In [3]:
# Method to show the first five rows
orders.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [4]:
# How to define columns names in DataFrames without header information and a custom separator
user_cols = ['user_id', 'age', 'gender', 'occupation', 'zip_code']
users = pd.read_table('http://bit.ly/movieusers', sep='|', header=None, names=user_cols)

In [5]:
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

## How do I select a pandas Series from a DataFrame?

In [6]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [7]:
# ufo is a DataFrame
type(ufo)

pandas.core.frame.DataFrame

In [8]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [9]:
# And each column is treated as a Series
type(ufo['City'])

pandas.core.series.Series

In [10]:
# How to create a new column in a DataFrame
ufo['Location'] = ufo.City + ', ' + ufo.State

In [11]:
ufo.head()

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca, NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro, NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke, CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene, KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair, NY"

## Why do some pandas command end with parentheses?

In [12]:
# Method to read CSV files (just like read_table defining a separator)
movies = pd.read_csv('http://bit.ly/imdbratings')

In [13]:
movies.head()

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [14]:
# Method to perform statistics in all numeric columns
movies.describe()

       star_rating    duration
count   979.000000  979.000000
mean      7.889785  120.979571
std       0.336069   26.218010
min       7.400000   64.000000
25%       7.600000  102.000000
50%       7.800000  117.000000
75%       8.100000  134.000000
max       9.300000  242.000000

In [15]:
# Method to show the number of rows and columns
movies.shape

(979, 6)

In [16]:
# Method to show each column data type
movies.dtypes

star_rating       float64
title              object
content_rating     object
genre              object
duration            int64
actors_list        object
dtype: object

In [17]:
type(movies)

pandas.core.frame.DataFrame

In [18]:
# With an argument, performs statistics on the columns with that data type
movies.describe(include=['object'])

,title,content_rating,genre,actors_list
count,979,976,979,979
unique,975,12,16,969
top,True Grit,R,Drama,"[u'Daniel Radcliffe', u'Emma Watson', u'Rupert..."
freq,2,460,278,6

## How do I rename columns in pandas DataFrame?

In [19]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [20]:
# Method to return the column names
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

In [21]:
# Method to rename columns
ufo.rename(columns={'Colors Reported':'Colors_Reported', 'Shape Reported':'Shape_Reported'}, inplace=True)

In [22]:
ufo.columns

Index(['City', 'Colors_Reported', 'Shape_Reported', 'State', 'Time'], dtype='object')

In [23]:
ufo_cols = ['city', 'colors reported', 'shapre reported', 'state', 'time']

In [24]:
# How to change column names for existing DataFrame
ufo.columns = ufo_cols

In [25]:
ufo.head()

                   city colors reported shapre reported state             time
0                Ithaca             NaN        TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN           OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN            OVAL    CO  2/15/1931 14:00
3               Abilene             NaN            DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN           LIGHT    NY  4/18/1933 19:00

In [26]:
# How to change column names while reading a new DataFrame
ufo = pd.read_csv('http://bit.ly/uforeports', names=ufo_cols, header=0)

In [27]:
ufo.head()

                   city colors reported shapre reported state             time
0                Ithaca             NaN        TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN           OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN            OVAL    CO  2/15/1931 14:00
3               Abilene             NaN            DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN           LIGHT    NY  4/18/1933 19:00

In [28]:
ufo.columns

Index(['city', 'colors reported', 'shapre reported', 'state', 'time'], dtype='object')

In [29]:
# How to tweak column names
ufo.columns = ufo.columns.str.replace(' ', '_')

In [30]:
ufo.columns

Index(['city', 'colors_reported', 'shapre_reported', 'state', 'time'], dtype='object')